nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f81000evk/common/pin_mux/pin_mux.c
/*
 * Copyright 2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: MC56F81768
package_id: MC56F81768LVLH
mcu_data: ksdk2_0
processor_version: 16.3.0
board: MC56F81000-EVK
pin_labels:
- {pin_num: '58', pin_signal: GPIOF6/PWMA_3X/LP_SCLS1/XB_IN2, label: 'J2[2]/D5/USER_LED1', identifier: LED_RED;LP_;LP_SCLS1}
- {pin_num: '53', pin_signal: GPIOE6/PWMA_3B/XB_IN4/XB_OUT10, label: 'J2[4]/J17[2]/J19[2]/SW2/PWMA_3B', identifier: SW2}
- {pin_num: '54', pin_signal: GPIOE7/PWMA_3A/XB_IN5/XB_OUT11, label: 'J3[3]/J18[2]/ENC_A/XB_IN5/SW3', identifier: SW3}
- {pin_num: '35', pin_signal: GPIOC10/MOSI0/XB_IN5/MISO0/XB_OUT9, label: 'J2[8]/U13[5]/MOSI0/XB_OUT9', identifier: MOSI0;QSPI0_MOSI}
- {pin_num: '34', pin_signal: GPIOC9/SCLK0/XB_IN4/TXD0/XB_OUT8, label: 'J2[12]/U13[6]/SCK0', identifier: SCK0;QSPI0_SCK}
- {pin_num: '33', pin_signal: GPIOC8/MISO0/RXD0/XB_IN9, label: 'J2[10]/U13[2]/MISO0', identifier: MISO0;QSPI0_MISO}
- {pin_num: '32', pin_signal: GPIOC7/SS0_B/TXD0/XB_IN8/XB_OUT6, label: 'J1[14]/U13[1]/SS0/XB_OUT6', identifier: SS0;QSPI0_SS0;QSPI0_SS}
- {pin_num: '31', pin_signal: GPIOC6/TA2/XB_IN3/CMP_REF/SS0_B, label: 'J1[3]', identifier: QSPI0_SS}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_sim.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
    BOARD_InitOSCPins();
    BOARD_InitDEBUG_UARTPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitBUTTONsPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '49', peripheral: GPIOC, signal: 'GPIO, 13', pin_signal: GPIOC13/TA3/XB_IN6/EWM_OUT_B, identifier: SW5, direction: INPUT, gpio_interrupt: gpioIrqFallingEdge}
  - {pin_num: '6', peripheral: GPIOF, signal: 'GPIO, 8', pin_signal: GPIOF8/RXD0/XB_OUT10/CMPD_O/PWMA_2X, identifier: SW4, direction: INPUT, gpio_interrupt: gpioIrqFallingEdge}
  - {pin_num: '53', peripheral: GPIOE, signal: 'GPIO, 6', pin_signal: GPIOE6/PWMA_3B/XB_IN4/XB_OUT10, direction: INPUT, gpio_interrupt: gpioIrqFallingEdge}
  - {pin_num: '54', peripheral: GPIOE, signal: 'GPIO, 7', pin_signal: GPIOE7/PWMA_3A/XB_IN5/XB_OUT11, direction: INPUT, gpio_interrupt: gpioIrqFallingEdge}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBUTTONsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBUTTONsPins(void)
{
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* GPIOE IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOE);
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* GPIO functionality on pin GPIOC13 (pin 49) */
    GPIO_PinSetPeripheralMode(BOARD_SW5_GPIO, BOARD_SW5_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOE6 (pin 53) */
    GPIO_PinSetPeripheralMode(BOARD_SW2_GPIO, BOARD_SW2_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOE7 (pin 54) */
    GPIO_PinSetPeripheralMode(BOARD_SW3_GPIO, BOARD_SW3_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF8 (pin 6) */
    GPIO_PinSetPeripheralMode(BOARD_SW4_GPIO, BOARD_SW4_PIN_MASK, kGPIO_ModeGpio);

    /* Initialize GPIO functionality on pin GPIOC13 (pin 49)  */
    GPIO_PinSetDirection(BOARD_SW5_GPIO, BOARD_SW5_PIN_MASK, kGPIO_DigitalInput);

    /* Initialize GPIO functionality on pin GPIOE6 (pin 53)  */
    GPIO_PinSetDirection(BOARD_SW2_GPIO, BOARD_SW2_PIN_MASK, kGPIO_DigitalInput);

    /* Initialize GPIO functionality on pin GPIOE7 (pin 54)  */
    GPIO_PinSetDirection(BOARD_SW3_GPIO, BOARD_SW3_PIN_MASK, kGPIO_DigitalInput);

    /* Initialize GPIO functionality on pin GPIOF8 (pin 6)  */
    GPIO_PinSetDirection(BOARD_SW4_GPIO, BOARD_SW4_PIN_MASK, kGPIO_DigitalInput);

    /* Interrupt configuration on GPIOC13 (pin 49): Interrupt on falling edge */
    GPIO_PinSetInterruptConfig(BOARD_SW5_GPIO, BOARD_SW5_PIN_MASK, kGPIO_InterruptFallingEdge);

    /* Interrupt configuration on GPIOE6 (pin 53): Interrupt on falling edge */
    GPIO_PinSetInterruptConfig(BOARD_SW2_GPIO, BOARD_SW2_PIN_MASK, kGPIO_InterruptFallingEdge);

    /* Interrupt configuration on GPIOE7 (pin 54): Interrupt on falling edge */
    GPIO_PinSetInterruptConfig(BOARD_SW3_GPIO, BOARD_SW3_PIN_MASK, kGPIO_InterruptFallingEdge);

    /* Interrupt configuration on GPIOF8 (pin 6): Interrupt on falling edge */
    GPIO_PinSetInterruptConfig(BOARD_SW4_GPIO, BOARD_SW4_PIN_MASK, kGPIO_InterruptFallingEdge);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLEDsPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '41', peripheral: GPIOF, signal: 'GPIO, 4', pin_signal: GPIOF4/TXD1/XB_OUT8/PWMA_0X/PWMA_FAULT6, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '42', peripheral: GPIOF, signal: 'GPIO, 5', pin_signal: GPIOF5/RXD1/XB_OUT9/PWMA_1X/PWMA_FAULT7, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '59', peripheral: GPIOF, signal: 'GPIO, 7', pin_signal: GPIOF7/CMPC_O/LP_SDAS1/XB_IN3, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '58', peripheral: GPIOF, signal: 'GPIO, 6', pin_signal: GPIOF6/PWMA_3X/LP_SCLS1/XB_IN2, identifier: LED_RED, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '45', peripheral: PWMA, signal: 'B, 0', pin_signal: GPIOE0/PWMA_0B/XB_OUT4}
  - {pin_num: '46', peripheral: PWMA, signal: 'A, 0', pin_signal: GPIOE1/PWMA_0A/XB_OUT5}
  - {pin_num: '47', peripheral: PWMA, signal: 'B, 1', pin_signal: GPIOE2/PWMA_1B/XB_OUT6}
  - {pin_num: '48', peripheral: PWMA, signal: 'A, 1', pin_signal: GPIOE3/PWMA_1A/XB_OUT7}
  - {pin_num: '51', peripheral: PWMA, signal: 'B, 2', pin_signal: GPIOE4/PWMA_2B/XB_IN2/LP_SCL1/XB_OUT8}
  - {pin_num: '52', peripheral: PWMA, signal: 'A, 2', pin_signal: GPIOE5/PWMA_2A/XB_IN3/LP_SDA1/XB_OUT9}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

