nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f81000evk/common/pin_mux/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLEDsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLEDsPins(void)
{
    /* GPIOE IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOE);
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* Enable peripheral functionality on pin GPIOE0 (pin 45) */
    GPIO_PinSetPeripheralMode(BOARD_LED0_GPIO, BOARD_LED0_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE0 (pin 45) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E0_PWMA_0B);
    /* Enable peripheral functionality on pin GPIOE1 (pin 46) */
    GPIO_PinSetPeripheralMode(BOARD_LED1_GPIO, BOARD_LED1_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE1 (pin 46) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E1_PWMA_0A);
    /* Enable peripheral functionality on pin GPIOE2 (pin 47) */
    GPIO_PinSetPeripheralMode(BOARD_LED2_GPIO, BOARD_LED2_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE2 (pin 47) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E2_PWMA_1B);
    /* Enable peripheral functionality on pin GPIOE3 (pin 48) */
    GPIO_PinSetPeripheralMode(BOARD_LED3_GPIO, BOARD_LED3_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE3 (pin 48) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E3_PWMA_1A);
    /* Enable peripheral functionality on pin GPIOE4 (pin 51) */
    GPIO_PinSetPeripheralMode(BOARD_LED4_GPIO, BOARD_LED4_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE4 (pin 51) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E4_PWMA_2B);
    /* Enable peripheral functionality on pin GPIOE5 (pin 52) */
    GPIO_PinSetPeripheralMode(BOARD_LED5_GPIO, BOARD_LED5_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE5 (pin 52) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E5_PWMA_2A);
    /* GPIO functionality on pin GPIOF4 (pin 41) */
    GPIO_PinSetPeripheralMode(BOARD_LED_BLUE_GPIO, BOARD_LED_BLUE_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF5 (pin 42) */
    GPIO_PinSetPeripheralMode(BOARD_LED_YELLOW_GPIO, BOARD_LED_YELLOW_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF6 (pin 58) */
    GPIO_PinSetPeripheralMode(BOARD_LED_RED_GPIO, BOARD_LED_RED_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF7 (pin 59) */
    GPIO_PinSetPeripheralMode(BOARD_LED_GREEN_GPIO, BOARD_LED_GREEN_PIN_MASK, kGPIO_ModeGpio);

    /* Initialize GPIO functionality on pin GPIOF4 (pin 41)  */
    GPIO_PinWrite(BOARD_LED_BLUE_GPIO, BOARD_LED_BLUE_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_LED_BLUE_GPIO, BOARD_LED_BLUE_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF5 (pin 42)  */
    GPIO_PinWrite(BOARD_LED_YELLOW_GPIO, BOARD_LED_YELLOW_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_LED_YELLOW_GPIO, BOARD_LED_YELLOW_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF6 (pin 58)  */
    GPIO_PinWrite(BOARD_LED_RED_GPIO, BOARD_LED_RED_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_LED_RED_GPIO, BOARD_LED_RED_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF7 (pin 59)  */
    GPIO_PinWrite(BOARD_LED_GREEN_GPIO, BOARD_LED_GREEN_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_LED_GREEN_GPIO, BOARD_LED_GREEN_PIN_MASK, kGPIO_DigitalOutput);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitOSCPins:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '3', peripheral: OCCS, signal: EXTAL, pin_signal: GPIOC0/EXTAL/CLKIN0, slew_rate: no_init, open_drain: no_init, pull_select: no_init, pull_enable: no_init}
  - {pin_num: '4', peripheral: OCCS, signal: XTAL, pin_signal: GPIOC1/XTAL, slew_rate: no_init, open_drain: no_init, pull_select: no_init, pull_enable: no_init}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitOSCPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitOSCPins(void)
{
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* Enable peripheral functionality on pin GPIOC0 (pin 3) */
    GPIO_PinSetPeripheralMode(GPIOC, kGPIO_Pin0, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC0 (pin 3) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C0_EXTAL);
    /* Enable peripheral functionality on pin GPIOC1 (pin 4) */
    GPIO_PinSetPeripheralMode(BOARD_XTAL_GPIO, BOARD_XTAL_PIN_MASK, kGPIO_ModePeripheral);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitTHERMISTORPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '9', peripheral: ADC, signal: 'ANA, 7', pin_signal: GPIOA7/ANA7/CMPD_IN3}
  - {pin_num: '10', peripheral: ADC, signal: 'ANA, 6', pin_signal: GPIOA6/ANA6/CMPD_IN2}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitTHERMISTORPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitTHERMISTORPins(void)
{
    /* GPIOA IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOA);
    /* Enable peripheral functionality on pin GPIOA6 (pin 10) */
    GPIO_PinSetPeripheralMode(BOARD_THER_A_GPIO, BOARD_THER_A_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOA7 (pin 9) */
    GPIO_PinSetPeripheralMode(BOARD_THER_B_GPIO, BOARD_THER_B_PIN_MASK, kGPIO_ModePeripheral);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSPI_FLASHPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '33', peripheral: QSPI0, signal: MISO, pin_signal: GPIOC8/MISO0/RXD0/XB_IN9, identifier: MISO0}
  - {pin_num: '34', peripheral: QSPI0, signal: SCLK, pin_signal: GPIOC9/SCLK0/XB_IN4/TXD0/XB_OUT8, identifier: SCK0}
  - {pin_num: '35', peripheral: QSPI0, signal: MOSI, pin_signal: GPIOC10/MOSI0/XB_IN5/MISO0/XB_OUT9, identifier: MOSI0}
  - {pin_num: '32', peripheral: QSPI0, signal: SS, pin_signal: GPIOC7/SS0_B/TXD0/XB_IN8/XB_OUT6, identifier: SS0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

