nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f81000evk/common/pin_mux/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSPI_FLASHPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitSPI_FLASHPins(void)
{
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* Enable peripheral functionality on pin GPIOC7 (pin 32) */
    GPIO_PinSetPeripheralMode(BOARD_SS0_GPIO, BOARD_SS0_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC7 (pin 32) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C7_SS0_B);
    /* Enable peripheral functionality on pin GPIOC8 (pin 33) */
    GPIO_PinSetPeripheralMode(BOARD_MISO0_GPIO, BOARD_MISO0_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC8 (pin 33) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C8_MISO0);
    /* Enable peripheral functionality on pin GPIOC9 (pin 34) */
    GPIO_PinSetPeripheralMode(BOARD_SCK0_GPIO, BOARD_SCK0_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC9 (pin 34) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C9_SCLK0);
    /* Enable peripheral functionality on pin GPIOC10 (pin 35) */
    GPIO_PinSetPeripheralMode(BOARD_MOSI0_GPIO, BOARD_MOSI0_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC10 (pin 35) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C10_MOSI0);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitACCELPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '39', peripheral: GPIOF, signal: 'GPIO, 2', pin_signal: GPIOF2/LP_SCL1/XB_OUT6/LP_SDA0, direction: OUTPUT, gpio_init_state: 'true', open_drain: enable,
    pull_enable: enable}
  - {pin_num: '40', peripheral: GPIOF, signal: 'GPIO, 3', pin_signal: GPIOF3/LP_SDA1/XB_OUT7/LP_SCL0, direction: INPUT, open_drain: enable, pull_enable: enable}
  - {pin_num: '58', peripheral: GPIOF, signal: 'GPIO, 6', pin_signal: GPIOF6/PWMA_3X/LP_SCLS1/XB_IN2, identifier: LP_SCLS1, direction: OUTPUT, gpio_init_state: 'true'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitACCELPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitACCELPins(void)
{
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* GPIO functionality on pin GPIOF2 (pin 39) */
    GPIO_PinSetPeripheralMode(BOARD_LP_SCL1_GPIO, BOARD_LP_SCL1_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF3 (pin 40) */
    GPIO_PinSetPeripheralMode(BOARD_LP_SDA1_GPIO, BOARD_LP_SDA1_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF6 (pin 58) */
    GPIO_PinSetPeripheralMode(BOARD_LP_SCLS1_GPIO, BOARD_LP_SCLS1_PIN_MASK, kGPIO_ModeGpio);

    /* Initialize GPIO functionality on pin GPIOF3 (pin 40)  */
    GPIO_PinSetDirection(BOARD_LP_SDA1_GPIO, BOARD_LP_SDA1_PIN_MASK, kGPIO_DigitalInput);

    /* Pin configuration on GPIOF2 (pin 39) */
    /* Pull-Pull/Open drain output mode configuration: Open drain output mode */
    GPIO_PinSetOutputMode(BOARD_LP_SCL1_GPIO, BOARD_LP_SCL1_PIN_MASK, kGPIO_OutputOpenDrain);

    /* Pin configuration on GPIOF3 (pin 40) */
    /* Pull-Pull/Open drain output mode configuration: Open drain output mode */
    GPIO_PinSetOutputMode(BOARD_LP_SDA1_GPIO, BOARD_LP_SDA1_PIN_MASK, kGPIO_OutputOpenDrain);

    /* Initialize GPIO functionality on pin GPIOF2 (pin 39)  */
    GPIO_PinWrite(BOARD_LP_SCL1_GPIO, BOARD_LP_SCL1_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_LP_SCL1_GPIO, BOARD_LP_SCL1_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF6 (pin 58)  */
    GPIO_PinWrite(BOARD_LP_SCLS1_GPIO, BOARD_LP_SCLS1_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_LP_SCLS1_GPIO, BOARD_LP_SCLS1_PIN_MASK, kGPIO_DigitalOutput);

    GPIOF->PUR = ((GPIOF->PUR &
                   /* Mask bits to zero which are setting */
                   (~(GPIO_PUR_PU_2_MASK | GPIO_PUR_PU_3_MASK)))

                  /* Pull Resistor Enable Bits: Pull resistor is enabled. */
                  | GPIO_PUR_PU(PUR_PU_2_ENABLED)

                  /* Pull Resistor Enable Bits: Pull resistor is enabled. */
                  | GPIO_PUR_PU(PUR_PU_3_ENABLED));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDEBUG_UARTPins:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '37', peripheral: QSCI1, signal: TXD, pin_signal: GPIOC11/LP_SCLS0/LP_SCL1/TXD1/PWMA_0X}
  - {pin_num: '38', peripheral: QSCI1, signal: RXD, pin_signal: GPIOC12/LP_SDAS0/LP_SDA1/RXD1/PWMA_1X}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitDEBUG_UARTPins(void)
{
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* Enable peripheral functionality on pin GPIOC11 (pin 37) */
    GPIO_PinSetPeripheralMode(BOARD_TXD1_GPIO, BOARD_TXD1_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC11 (pin 37) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C11_TXD1);
    /* Enable peripheral functionality on pin GPIOC12 (pin 38) */
    GPIO_PinSetPeripheralMode(BOARD_RXD1_GPIO, BOARD_RXD1_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC12 (pin 38) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C12_RXD1);

    /* Internal Peripheral Select */
    /* Select SCI1_RXD Input.: Select SCI1_RXD Input, GPIOC12 or GPIOF5. */
    SIM_SetInternalPeriInput(SIM, kSIM_SCI1_RXDInputIndex, kSIM_SCI1_RXDInput_GPIOC12_GPIOF5);

