nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f81000evk/common/pin_mux/pin_mux.c
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitI2CPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '55', peripheral: LPI2C0, signal: SDA, pin_signal: GPIOC14/LP_SDA0/XB_OUT4/PWMA_FAULT4, open_drain: enable, pull_enable: disable}
  - {pin_num: '56', peripheral: LPI2C0, signal: SCL, pin_signal: GPIOC15/LP_SCL0/XB_OUT5/PWMA_FAULT5, open_drain: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitI2CPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitI2CPins(void)
{
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* Enable peripheral functionality on pin GPIOC14 (pin 55) */
    GPIO_PinSetPeripheralMode(BOARD_LP_SDA0_GPIO, BOARD_LP_SDA0_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC14 (pin 55) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C14_LP_SDA0);
    /* Enable peripheral functionality on pin GPIOC15 (pin 56) */
    GPIO_PinSetPeripheralMode(BOARD_LP_SCL0_GPIO, BOARD_LP_SCL0_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC15 (pin 56) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C15_LP_SCL0);

    /* Pin configuration on GPIOC14 (pin 55) */
    /* Pull-Pull/Open drain output mode configuration: Open drain output mode */
    GPIO_PinSetOutputMode(BOARD_LP_SDA0_GPIO, BOARD_LP_SDA0_PIN_MASK, kGPIO_OutputOpenDrain);

    /* Pin configuration on GPIOC15 (pin 56) */
    /* Pull-Pull/Open drain output mode configuration: Open drain output mode */
    GPIO_PinSetOutputMode(BOARD_LP_SCL0_GPIO, BOARD_LP_SCL0_PIN_MASK, kGPIO_OutputOpenDrain);

    GPIOC->PUR = ((GPIOC->PUR &
                   /* Mask bits to zero which are setting */
                   (~(GPIO_PUR_PU_14_MASK)))

                  /* Pull Resistor Enable Bits: Pull resistor is disabled. */
                  | GPIO_PUR_PU(PUR_PU_14_DISABLED));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSPIPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '31', peripheral: QSPI0, signal: SS, pin_signal: GPIOC6/TA2/XB_IN3/CMP_REF/SS0_B, pull_enable: enable}
  - {pin_num: '32', peripheral: GPIOC, signal: 'GPIO, 7', pin_signal: GPIOC7/SS0_B/TXD0/XB_IN8/XB_OUT6, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '33', peripheral: QSPI0, signal: MISO, pin_signal: GPIOC8/MISO0/RXD0/XB_IN9, identifier: QSPI0_MISO, pull_enable: enable}
  - {pin_num: '34', peripheral: QSPI0, signal: SCLK, pin_signal: GPIOC9/SCLK0/XB_IN4/TXD0/XB_OUT8, identifier: QSPI0_SCK, pull_enable: enable}
  - {pin_num: '35', peripheral: QSPI0, signal: MOSI, pin_signal: GPIOC10/MOSI0/XB_IN5/MISO0/XB_OUT9, identifier: QSPI0_MOSI, pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSPIPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitSPIPins(void)
{
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* Enable peripheral functionality on pin GPIOC6 (pin 31) */
    GPIO_PinSetPeripheralMode(BOARD_QSPI0_SS_GPIO, BOARD_QSPI0_SS_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC6 (pin 31) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C6_SS0_B);
    /* GPIO functionality on pin GPIOC7 (pin 32) */
    GPIO_PinSetPeripheralMode(GPIOC, kGPIO_Pin7, kGPIO_ModeGpio);
    /* Enable peripheral functionality on pin GPIOC8 (pin 33) */
    GPIO_PinSetPeripheralMode(BOARD_QSPI0_MISO_GPIO, BOARD_QSPI0_MISO_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC8 (pin 33) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C8_MISO0);
    /* Enable peripheral functionality on pin GPIOC9 (pin 34) */
    GPIO_PinSetPeripheralMode(BOARD_QSPI0_SCK_GPIO, BOARD_QSPI0_SCK_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC9 (pin 34) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C9_SCLK0);
    /* Enable peripheral functionality on pin GPIOC10 (pin 35) */
    GPIO_PinSetPeripheralMode(BOARD_QSPI0_MOSI_GPIO, BOARD_QSPI0_MOSI_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC10 (pin 35) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C10_MOSI0);

    /* Initialize GPIO functionality on pin GPIOC7 (pin 32)  */
    GPIO_PinWrite(GPIOC, kGPIO_Pin7, kGPIO_OutputHigh);
    GPIO_PinSetDirection(GPIOC, kGPIO_Pin7, kGPIO_DigitalOutput);

    GPIOC->PUR = ((GPIOC->PUR &
                   /* Mask bits to zero which are setting */
                   (~(GPIO_PUR_PU_6_MASK | GPIO_PUR_PU_8_MASK | GPIO_PUR_PU_9_MASK | GPIO_PUR_PU_10_MASK)))

                  /* Pull Resistor Enable Bits: Pull resistor is enabled. */
                  | GPIO_PUR_PU(PUR_PU_6_ENABLED)

                  /* Pull Resistor Enable Bits: Pull resistor is enabled. */
                  | GPIO_PUR_PU(PUR_PU_8_ENABLED)

                  /* Pull Resistor Enable Bits: Pull resistor is enabled. */
                  | GPIO_PUR_PU(PUR_PU_9_ENABLED)

                  /* Pull Resistor Enable Bits: Pull resistor is enabled. */
                  | GPIO_PUR_PU(PUR_PU_10_ENABLED));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
